index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-06 Tue 23:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git from the ground up</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Git from the ground up</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org676c46c">1. github pages using org mode</a></li>
<li><a href="#org6f48545">2. then create a <b>_config.yml</b> file and add the following content in it.</a></li>
<li><a href="#org0403b0d">3. org file link test</a>
<ul>
<li><a href="#org5f2a19b">3.1. test</a></li>
</ul>
</li>
<li><a href="#orga73822f">4. all org mode link</a></li>
</ul>
</div>
</div>
<div id="outline-container-org676c46c" class="outline-2">
<h2 id="org676c46c"><span class="section-number-2">1.</span> github pages using org mode</h2>
<div class="outline-text-2" id="text-1">
<p>
create a <code>README.org</code> file add the following in it at the start.
</p>

<div class="org-src-container">
<pre class="src src-nil">#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+EXPORT_FILE_NAME: index
</pre>
</div>
</div>
</div>
<div id="outline-container-org6f48545" class="outline-2">
<h2 id="org6f48545"><span class="section-number-2">2.</span> then create a <b>_config.yml</b> file and add the following content in it.</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-yaml">remote_theme: pages-themes/cayman@v0.2.0
plugins:
- jekyll-remote-theme # add this line to the plugins list if you already have one
</pre>
</div>

<p>
but we have a local theme file i.e 
</p>

<div class="org-src-container">
<pre class="src src-yaml">theme: jekyll-theme-readtheorg
sass:
  sass_dir: .
  style: compressed
</pre>
</div>

<p>
to export the tangled source code use the keybind <code>C-c C-v t</code> which exports the code blocks to source specific files.
</p>
</div>
</div>
<div id="outline-container-org0403b0d" class="outline-2">
<h2 id="org0403b0d"><span class="section-number-2">3.</span> org file link test</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="Git-from-the-ground-up.html">git from the ground up</a>
</p>
</div>
<div id="outline-container-org5f2a19b" class="outline-3">
<h3 id="org5f2a19b"><span class="section-number-3">3.1.</span> test</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #8f0075; font-weight: bold;">echo</span> <span style="color: #3548cf;">"My current working dir is: $(pwd)"</span>
git status 2&gt;&amp;1 || <span style="color: #8f0075; font-weight: bold;">echo</span> Git is not happy.
</pre>
</div>

<pre class="example" id="org2de69ec">
My current working dir is: /home/vipulmx/Projects/Code/learnings
On branch main
Your branch is up to date with 'origin/main'.

Changes not staged for commit:
  (use "git add &lt;file&gt;..." to update what will be committed)
  (use "git restore &lt;file&gt;..." to discard changes in working directory)
	modified:   README.org

no changes added to commit (use "git add" and/or "git commit -a")
</pre>
</div>
</div>
</div>
<div id="outline-container-orga73822f" class="outline-2">
<h2 id="orga73822f"><span class="section-number-2">4.</span> all org mode link</h2>
<div class="outline-text-2" id="text-4">
<p>
best themes for org html reside here <a href="https://olmon.gitlab.io/org-themes/">all links</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-08-06 Tue 23:20</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
